Ran Plan for project: `eks/eksd_apnortheast2/eksdapne2-lvvd` dir: `terraform/eks/eksd_apnortheast2/eksdapne2-lvvd` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.terraform_remote_state.vpc: Reading...
data.terraform_remote_state.vpc: Read complete after 0s
module.eks.data.aws_kms_alias.ebs: Reading...
data.aws_eks_cluster_auth.cluster: Reading...
module.eks.data.aws_iam_policy_document.assume_role: Reading...
data.aws_eks_cluster_auth.cluster: Read complete after 0s [id=eksdapne2-lvvd]
module.eks.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=3552664922]
module.eks.data.aws_kms_alias.ebs: Read complete after 1s [id=arn:aws:kms:ap-northeast-2:533267446521:alias/aws/ebs]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks.data.aws_security_group.cluster_sg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_security_group" "cluster_sg" {
      + arn         = (known after apply)
      + description = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + region      = (known after apply)
      + tags        = {
          + "aws:eks:cluster-name" = "eksdapne2-lvvd"
        }
      + vpc_id      = (known after apply)
    }

  # module.eks.data.tls_certificate.oidc will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "oidc" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_autoscaling_group_tag.aws_node_termination_handler_asg[0] will be created
+ resource "aws_autoscaling_group_tag" "aws_node_termination_handler_asg" {
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)
      + region                 = "ap-northeast-2"

      + tag {
          + key                 = "aws-node-termination-handler/managed"
          + propagate_at_launch = true
          + value               = "true"
        }
    }

  # module.eks.aws_autoscaling_group_tag.aws_node_termination_handler_asg[1] will be created
+ resource "aws_autoscaling_group_tag" "aws_node_termination_handler_asg" {
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)
      + region                 = "ap-northeast-2"

      + tag {
          + key                 = "aws-node-termination-handler/managed"
          + propagate_at_launch = true
          + value               = "true"
        }
    }

  # module.eks.aws_autoscaling_lifecycle_hook.aws_node_termination_handler_asg[0] will be created
+ resource "aws_autoscaling_lifecycle_hook" "aws_node_termination_handler_asg" {
      + autoscaling_group_name = (known after apply)
      + default_result         = "CONTINUE"
      + heartbeat_timeout      = 300
      + id                     = (known after apply)
      + lifecycle_transition   = "autoscaling:EC2_INSTANCE_TERMINATING"
      + name                   = (known after apply)
      + region                 = "ap-northeast-2"
    }

  # module.eks.aws_autoscaling_lifecycle_hook.aws_node_termination_handler_asg[1] will be created
+ resource "aws_autoscaling_lifecycle_hook" "aws_node_termination_handler_asg" {
      + autoscaling_group_name = (known after apply)
      + default_result         = "CONTINUE"
      + heartbeat_timeout      = 300
      + id                     = (known after apply)
      + lifecycle_transition   = "autoscaling:EC2_INSTANCE_TERMINATING"
      + name                   = (known after apply)
      + region                 = "ap-northeast-2"
    }

  # module.eks.aws_cloudwatch_event_rule.aws_node_termination_handler["eksdapne2-lvvd-aws-node-termination-handler-health-check"] will be created
+ resource "aws_cloudwatch_event_rule" "aws_node_termination_handler" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + eventTypeCategory = [
                      + "scheduledChange",
                    ]
                  + service           = [
                      + "EC2",
                    ]
                }
              + detail-type = [
                  + "AWS Health Event",
                ]
              + source      = [
                  + "aws.health",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "eksdapne2-lvvd-aws-node-termination-handler-health-check"
      + name_prefix    = (known after apply)
      + region         = "ap-northeast-2"
      + tags_all       = (known after apply)
    }

  # module.eks.aws_cloudwatch_event_rule.aws_node_termination_handler["eksdapne2-lvvd-aws-node-termination-handler-spot-terminate"] will be created
+ resource "aws_cloudwatch_event_rule" "aws_node_termination_handler" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "EC2 Spot Instance Interruption Warning",
                ]
              + source      = [
                  + "aws.ec2",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "eksdapne2-lvvd-aws-node-termination-handler-spot-terminate"
      + name_prefix    = (known after apply)
      + region         = "ap-northeast-2"
      + tags_all       = (known after apply)
    }

  # module.eks.aws_cloudwatch_event_target.aws_node_termination_handler["eksdapne2-lvvd-aws-node-termination-handler-health-check"] will be created
+ resource "aws_cloudwatch_event_target" "aws_node_termination_handler" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "ap-northeast-2"
      + rule           = "eksdapne2-lvvd-aws-node-termination-handler-health-check"
      + target_id      = (known after apply)
    }

  # module.eks.aws_cloudwatch_event_target.aws_node_termination_handler["eksdapne2-lvvd-aws-node-termination-handler-spot-terminate"] will be created
+ resource "aws_cloudwatch_event_target" "aws_node_termination_handler" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "ap-northeast-2"
      + rule           = "eksdapne2-lvvd-aws-node-termination-handler-spot-terminate"
      + target_id      = (known after apply)
    }

  # module.eks.aws_ec2_tag.karpenter_cluster_sg_tag will be created
+ resource "aws_ec2_tag" "karpenter_cluster_sg_tag" {
      + id          = (known after apply)
      + key         = "karpenter.sh/discovery"
      + region      = "ap-northeast-2"
      + resource_id = (known after apply)
      + value       = "eksdapne2-lvvd"
    }

  # module.eks.aws_ec2_tag.karpenter_private_subnet_tag["subnet-03d4b1321b10d10b7"] will be created
+ resource "aws_ec2_tag" "karpenter_private_subnet_tag" {
      + id          = (known after apply)
      + key         = "karpenter.sh/discovery"
      + region      = "ap-northeast-2"
      + resource_id = "subnet-03d4b1321b10d10b7"
      + value       = "eksdapne2-lvvd"
    }

  # module.eks.aws_ec2_tag.karpenter_private_subnet_tag["subnet-0a582659a519bf026"] will be created
+ resource "aws_ec2_tag" "karpenter_private_subnet_tag" {
      + id          = (known after apply)
      + key         = "karpenter.sh/discovery"
      + region      = "ap-northeast-2"
      + resource_id = "subnet-0a582659a519bf026"
      + value       = "eksdapne2-lvvd"
    }

  # module.eks.aws_eks_access_entry.access_entry["accountadmin"] will be created
+ resource "aws_eks_access_entry" "access_entry" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "eksdapne2-lvvd"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::533267446521:user/overtake-devops-admin"
      + region            = "ap-northeast-2"
      + tags              = {
          + "account"    = "id"
          + "aws_region" = "ap-northeast-2"
          + "product"    = "eks"
          + "shard_id"   = "eksdapne2"
        }
      + tags_all          = {
          + "account"    = "id"
          + "aws_region" = "ap-northeast-2"
          + "product"    = "eks"
          + "shard_id"   = "eksdapne2"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks.aws_eks_access_policy_association.access_policy_association["accountadmin-kubeadmin"] will be created
+ resource "aws_eks_access_policy_association" "access_policy_association" {
      + associated_at = (known after apply)
      + cluster_name  = "eksdapne2-lvvd"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::533267446521:user/overtake-devops-admin"
      + region        = "ap-northeast-2"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.eks.aws_eks_addon.coredns will be created
+ resource "aws_eks_addon" "coredns" {
      + addon_name                  = "coredns"
      + addon_version               = "v1.11.4-eksbuild.2"
      + arn                         = (known after apply)
      + cluster_name                = "eksdapne2-lvvd"
      + configuration_values        = jsonencode(
            {
              + nodeSelector = {
                  + capacity_type = "cpu_on_demand"
                }
            }
        )
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + region                      = "ap-northeast-2"
      + resolve_conflicts_on_create = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # module.eks.aws_eks_addon.kube_proxy will be created
+ resource "aws_eks_addon" "kube_proxy" {
      + addon_name                  = "kube-proxy"
      + addon_version               = "v1.30.0-eksbuild.2"
      + arn                         = (known after apply)
      + cluster_name                = "eksdapne2-lvvd"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + region                      = "ap-northeast-2"
      + resolve_conflicts_on_create = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # module.eks.aws_eks_addon.vpc_cni will be created
+ resource "aws_eks_addon" "vpc_cni" {
      + addon_name                  = "vpc-cni"
      + addon_version               = "v1.19.2-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "eksdapne2-lvvd"
      + configuration_values        = jsonencode(
            {
              + enableNetworkPolicy = "true"
            }
        )
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + region                      = "ap-northeast-2"
      + resolve_conflicts_on_create = "OVERWRITE"
      + service_account_role_arn    = (known after apply)
      + tags_all                    = (known after apply)
    }

  # module.eks.aws_eks_cluster.eks_cluster will be created
+ resource "aws_eks_cluster" "eks_cluster" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + deletion_protection           = (known after apply)
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "eksdapne2-lvvd"
      + platform_version              = (known after apply)
      + region                        = "ap-northeast-2"
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "Name"       = "eksdapne2-lvvd"
          + "account"    = "id"
          + "aws_region" = "ap-northeast-2"
          + "product"    = "eks"
          + "shard_id"   = "eksdapne2"
        }
      + tags_all                      = {
          + "Name"       = "eksdapne2-lvvd"
          + "account"    = "id"
          + "aws_region" = "ap-northeast-2"
          + "product"    = "eks"
          + "shard_id"   = "eksdapne2"
        }
      + version                       = "1.33"

      + access_config {
          + authentication_mode                         = "API_AND_CONFIG_MAP"
          + bootstrap_cluster_creator_admin_permissions = true
        }

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = "172.20.0.0/16"
          + service_ipv6_cidr = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-03d4b1321b10d10b7",
              + "subnet-0a582659a519bf026",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_eks_node_group.eks_node_group["ondemand_default"] will be created
+ resource "aws_eks_node_group" "eks_node_group" {
      + ami_type               = "AL2023_x86_64_STANDARD"
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "eksdapne2-lvvd"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.large",
        ]
      + labels                 = {
          + "capacity_type" = "cpu_on_demand"
          + "cpu_chip"      = "intel"
        }
      + node_group_name        = "eksdapne2-lvvd-ng-ondemand_default"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + region                 = "ap-northeast-2"
      + release_version        = "1.33.7-20260209"
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-03d4b1321b10d10b7",
          + "subnet-0a582659a519bf026",
        ]
      + tags                   = {
          + "Name"                                 = "eksdapne2-lvvd-ng-ondemand_default"
          + "account"                              = "id"
          + "aws_region"                           = "ap-northeast-2"
          + "kubernetes.io/cluster/eksdapne2-lvvd" = "owned"
          + "product"                              = "eks"
          + "shard_id"                             = "eksdapne2"
        }
      + tags_all               = {
          + "Name"                                 = "eksdapne2-lvvd-ng-ondemand_default"
          + "account"                              = "id"
          + "aws_region"                           = "ap-northeast-2"
          + "kubernetes.io/cluster/eksdapne2-lvvd" = "owned"
          + "product"                              = "eks"
          + "shard_id"                             = "eksdapne2"
        }
      + version                = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 0
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # module.eks.aws_eks_node_group.eks_node_group["spot_default"] will be created
+ resource "aws_eks_node_group" "eks_node_group" {
      + ami_type               = "AL2023_x86_64_STANDARD"
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "eksdapne2-lvvd"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.large",
        ]
      + labels                 = {
          + "capacity_type" = "spot"
          + "cpu_chip"      = "intel"
        }
      + node_group_name        = "eksdapne2-lvvd-ng-spot_default"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + region                 = "ap-northeast-2"
      + release_version        = "1.33.7-20260209"
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-03d4b1321b10d10b7",
          + "subnet-0a582659a519bf026",
        ]
      + tags                   = {
          + "Name"                                 = "eksdapne2-lvvd-ng-spot_default"
          + "account"                              = "id"
          + "aws_region"                           = "ap-northeast-2"
          + "kubernetes.io/cluster/eksdapne2-lvvd" = "owned"
          + "product"                              = "eks"
          + "shard_id"                             = "eksdapne2"
        }
      + tags_all               = {
          + "Name"                                 = "eksdapne2-lvvd-ng-spot_default"
          + "account"                              = "id"
          + "aws_region"                           = "ap-northeast-2"
          + "kubernetes.io/cluster/eksdapne2-lvvd" = "owned"
          + "product"                              = "eks"
          + "shard_id"                             = "eksdapne2"
        }
      + version                = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 5
          + min_size     = 0
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # module.eks.aws_fis_experiment_template.aws_node_termination_handler_fis will be created
+ resource "aws_fis_experiment_template" "aws_node_termination_handler_fis" {
      + description = "Spot Interrupt for testing node termination handler"
      + id          = (known after apply)
      + region      = "ap-northeast-2"
      + role_arn    = (known after apply)
      + tags        = {
          + "Name" = "aws_node_termination_handler_fis"
        }
      + tags_all    = {
          + "Name" = "aws_node_termination_handler_fis"
        }

      + action {
          + action_id   = "aws:ec2:send-spot-instance-interruptions"
          + description = "Terminate spots"
          + name        = "instance-terminate"
          + start_after = []

          + parameter {
              + key   = "durationBeforeInterruption"
              + value = "PT2M"
            }

          + target {
              + key   = "SpotInstances"
              + value = "eks-spot-node-nth-handled"
            }
        }

      + stop_condition {
          + source = "none"
        }

      + target {
          + name           = "eks-spot-node-nth-handled"
          + resource_arns  = []
          + resource_type  = "aws:ec2:spot-instance"
          + selection_mode = "COUNT(1)"

          + filter {
              + path   = "State.Name"
              + values = [
                  + "running",
                ]
            }

          + resource_tag {
              + key   = "aws-node-termination-handler/managed"
              + value = "true"
            }
          + resource_tag {
              + key   = "aws:eks:cluster-name"
              + value = "eksdapne2-lvvd"
            }
        }
    }

  # module.eks.aws_iam_instance_profile.eks_node_group will be created
+ resource "aws_iam_instance_profile" "eks_node_group" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "eks-eksdapne2-lvvd-ng"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "eks-eksdapne2-lvvd-ng"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.eks.aws_iam_openid_connect_provider.eks will be created
+ resource "aws_iam_openid_connect_provider" "eks" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks.aws_iam_policy.alb_controller will be created
+ resource "aws_iam_policy" "alb_controller" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "eks-eksdapne2-lvvd-alb-controller-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "iam:CreateServiceLinkedRole"
                      + Condition = {
                          + StringEquals = {
                              + "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeTags",
                          + "ec2:GetCoipPoolUsage",
                          + "ec2:DescribeCoipPools",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeListenerCertificates",
                          + "elasticloadbalancing:DescribeSSLPolicies",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTags",
                          + "elasticloadbalancing:DescribeListenerAttributes",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "cognito-idp:DescribeUserPoolClient",
                          + "acm:ListCertificates",
                          + "acm:DescribeCertificate",
                          + "iam:ListServerCertificates",
                          + "iam:GetServerCertificate",
                          + "waf-regional:GetWebACL",
                          + "waf-regional:GetWebACLForResource",
                          + "waf-regional:AssociateWebACL",
                          + "waf-regional:DisassociateWebACL",
                          + "wafv2:GetWebACL",
                          + "wafv2:GetWebACLForResource",
                          + "wafv2:AssociateWebACL",
                          + "wafv2:DisassociateWebACL",
                          + "shield:GetSubscriptionState",
                          + "shield:DescribeProtection",
                          + "shield:CreateProtection",
                          + "shield:DeleteProtection",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateSecurityGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "ec2:CreateAction" = "CreateSecurityGroup"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                          + "ec2:DeleteTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DeleteSecurityGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:CreateTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:CreateListener",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:DeleteRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "elasticloadbalancing:CreateAction" = [
                                  + "CreateTargetGroup",
                                  + "CreateLoadBalancer",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:SetIpAddressType",
                          + "elasticloadbalancing:SetSecurityGroups",
                          + "elasticloadbalancing:SetSubnets",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                          + "elasticloadbalancing:ModifyTargetGroup",
                          + "elasticloadbalancing:ModifyTargetGroupAttributes",
                          + "elasticloadbalancing:DeleteTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:DeregisterTargets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:SetWebAcl",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:AddListenerCertificates",
                          + "elasticloadbalancing:RemoveListenerCertificates",
                          + "elasticloadbalancing:ModifyRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.eks.aws_iam_policy.aws_node_termination_handler will be created
+ resource "aws_iam_policy" "aws_node_termination_handler" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "eks-eksdapne2-lvvd-aws-node-termination-handler-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "autoscaling:CompleteLifecycleAction",
                          + "autoscaling:DescribeAutoScalingInstances",
                          + "autoscaling:DescribeTags",
                          + "ec2:DescribeInstances",
                          + "sqs:DeleteMessage",
                          + "sqs:ReceiveMessage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.eks.aws_iam_policy.aws_node_termination_handler_fis will be created
+ resource "aws_iam_policy" "aws_node_termination_handler_fis" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "For FIS with Note Termination Handler"
      + id               = (known after apply)
      + name             = "eks-eksdapne2-lvvd-aws-node-termination-handler-fis-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:SendSpotInstanceInterruptions",
                          + "ec2:TerminateInstances",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ec2:*:533267446521:instance/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.eks.aws_iam_policy.external_secrets will be created
+ resource "aws_iam_policy" "external_secrets" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "eks-eksdapne2-lvvd-external-secrets"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "kms:GetPublicKey",
                          + "kms:Decrypt",
                          + "kms:ListKeyPolicies",
                          + "kms:ListRetirableGrants",
                          + "kms:GetKeyPolicy",
                          + "kms:ListResourceTags",
                          + "kms:ListGrants",
                          + "kms:GetParametersForImport",
                          + "kms:DescribeCustomKeyStores",
                          + "kms:ListKeys",
                          + "kms:GetKeyRotationStatus",
                          + "kms:Encrypt",
                          + "kms:ListAliases",
                          + "kms:DescribeKey",
                        ]
                      + Condition = {
                          + "ForAllValues:StringEquals" = {
                              + "aws:ResourceTag/kubernetes.io/cluster/eksdapne2-lvvd" = [
                                  + "owned",
                                  + "shared",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "ssm:GetParameterHistory",
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                          + "ssm:DescribeParameters",
                          + "ssm:GetParametersByPath",
                        ]
                      + Condition = {
                          + "ForAllValues:StringEquals" = {
                              + "aws:ResourceTag/kubernetes.io/cluster/eksdapne2-lvvd" = [
                                  + "owned",
                                  + "shared",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "secretsmanager:ListSecrets",
                          + "secretsmanager:GetResourcePolicy",
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:DescribeSecret",
                          + "secretsmanager:ListSecretVersionIds",
                        ]
                      + Condition = {
                          + "ForAllValues:StringEquals" = {
                              + "aws:ResourceTag/kubernetes.io/cluster/eksdapne2-lvvd" = [
                                  + "owned",
                                  + "shared",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.eks.aws_iam_policy.karpenter_controller will be created
+ resource "aws_iam_policy" "karpenter_controller" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "eks-eksdapne2-lvvd-karpenter-controller-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.eks.aws_iam_policy.route53 will be created
+ resource "aws_iam_policy" "route53" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "eks-eksdapne2-lvvd-route53"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "route53:ChangeResourceRecordSets",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:route53:::hostedzone/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "route53:ListHostedZones",
                          + "route53:ListResourceRecordSets",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.eks.aws_iam_role.alb_controller_assumerole will be created
+ resource "aws_iam_role" "alb_controller_assumerole" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-eksdapne2-lvvd-alb-controller"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role.aws_node_termination_handler will be created
+ resource "aws_iam_role" "aws_node_termination_handler" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-eksdapne2-lvvd-aws-node-termination-handler"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role.aws_node_termination_handler_fis will be created
+ resource "aws_iam_role" "aws_node_termination_handler_fis" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "fis.amazonaws.com",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-eksdapne2-lvvd-aws-node-termination-handler-fis-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role.cni_irsa_role will be created
+ resource "aws_iam_role" "cni_irsa_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + description           = "CNI plugin role for EKS cluster eksdapne2-lvvd"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-eksdapne2-lvvd-cni-plugin"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role.eks_cluster will be created
+ resource "aws_iam_role" "eks_cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Allows access to other AWS service resources that are required to operate clusters managed by EKS."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-eksdapne2-lvvd"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role.eks_node_group will be created
+ resource "aws_iam_role" "eks_node_group" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Allows EC2 instances to call AWS services on your behalf."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-eksdapne2-lvvd-ng"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role.external_dns will be created
+ resource "aws_iam_role" "external_dns" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-eksdapne2-lvvd-external-dns"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role.external_secrets will be created
+ resource "aws_iam_role" "external_secrets" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-eksdapne2-lvvd-external-secrets"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role.karpenter_controller will be created
+ resource "aws_iam_role" "karpenter_controller" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-eksdapne2-lvvd-karpenter-controller"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.alb_controller will be created
+ resource "aws_iam_role_policy_attachment" "alb_controller" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "eks-eksdapne2-lvvd-alb-controller"
    }

  # module.eks.aws_iam_role_policy_attachment.aws_node_termination_handler will be created
+ resource "aws_iam_role_policy_attachment" "aws_node_termination_handler" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "eks-eksdapne2-lvvd-aws-node-termination-handler"
    }

  # module.eks.aws_iam_role_policy_attachment.aws_node_termination_handler_fis will be created
+ resource "aws_iam_role_policy_attachment" "aws_node_termination_handler_fis" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "eks-eksdapne2-lvvd-aws-node-termination-handler-fis-role"
    }

  # module.eks.aws_iam_role_policy_attachment.cni_irsa_policy will be created
+ resource "aws_iam_role_policy_attachment" "cni_irsa_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "eks-eksdapne2-lvvd-cni-plugin"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_cluster_AmazonEKSClusterPolicy will be created
+ resource "aws_iam_role_policy_attachment" "eks_cluster_AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "eks-eksdapne2-lvvd"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_cluster_AmazonEKSVPCResourceController will be created
+ resource "aws_iam_role_policy_attachment" "eks_cluster_AmazonEKSVPCResourceController" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "eks-eksdapne2-lvvd"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_node_AmazonEBSCSIDriverPolicy will be created
+ resource "aws_iam_role_policy_attachment" "eks_node_AmazonEBSCSIDriverPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy"
      + role       = "eks-eksdapne2-lvvd-ng"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_node_AmazonEC2ContainerRegistryReadOnly will be created
+ resource "aws_iam_role_policy_attachment" "eks_node_AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "eks-eksdapne2-lvvd-ng"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_node_AmazonEKSWorkerNodePolicy will be created
+ resource "aws_iam_role_policy_attachment" "eks_node_AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "eks-eksdapne2-lvvd-ng"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_node_AmazonEKS_CNI_Policy will be created
+ resource "aws_iam_role_policy_attachment" "eks_node_AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "eks-eksdapne2-lvvd-ng"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_node_AmazonSSMManagedInstanceCore will be created
+ resource "aws_iam_role_policy_attachment" "eks_node_AmazonSSMManagedInstanceCore" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "eks-eksdapne2-lvvd-ng"
    }

  # module.eks.aws_iam_role_policy_attachment.external_dns_route53 will be created
+ resource "aws_iam_role_policy_attachment" "external_dns_route53" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "eks-eksdapne2-lvvd-external-dns"
    }

  # module.eks.aws_iam_role_policy_attachment.external_secrets will be created
+ resource "aws_iam_role_policy_attachment" "external_secrets" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "eks-eksdapne2-lvvd-external-secrets"
    }

  # module.eks.aws_iam_role_policy_attachment.karpenter_controller will be created
+ resource "aws_iam_role_policy_attachment" "karpenter_controller" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "eks-eksdapne2-lvvd-karpenter-controller"
    }

  # module.eks.aws_launch_template.eks_node_group[0] will be created
+ resource "aws_launch_template" "eks_node_group" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + latest_version  = (known after apply)
      + name            = "eksdapne2-lvvd-node-launch-template"
      + name_prefix     = (known after apply)
      + region          = "ap-northeast-2"
      + tags_all        = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + delete_on_termination      = "true"
              + encrypted                  = "true"
              + iops                       = 3000
              + kms_key_id                 = "arn:aws:kms:ap-northeast-2:533267446521:alias/aws/ebs"
              + throughput                 = 125
              + volume_initialization_rate = (known after apply)
              + volume_size                = 30
              + volume_type                = "gp3"
            }
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 2
          + http_tokens                 = "optional"
          + instance_metadata_tags      = (known after apply)
        }
    }

  # module.eks.aws_security_group.eks_cluster will be created
+ resource "aws_security_group" "eks_cluster" {
      + arn                    = (known after apply)
      + description            = "Cluster communication with Worker Nodes"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.20.0.0/16",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
            },
        ]
      + name                   = "eks-eksdapne2-lvvd-cluster-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "ap-northeast-2"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                                 = "eks-eksdapne2-lvvd-cluster-sg"
          + "account"                              = "id"
          + "aws_region"                           = "ap-northeast-2"
          + "kubernetes.io/cluster/eksdapne2-lvvd" = "owned"
          + "product"                              = "eks"
          + "shard_id"                             = "eksdapne2"
        }
      + tags_all               = {
          + "Name"                                 = "eks-eksdapne2-lvvd-cluster-sg"
          + "account"                              = "id"
          + "aws_region"                           = "ap-northeast-2"
          + "kubernetes.io/cluster/eksdapne2-lvvd" = "owned"
          + "product"                              = "eks"
          + "shard_id"                             = "eksdapne2"
        }
      + vpc_id                 = "vpc-02c04a80aa4e3c6e9"
    }

  # module.eks.aws_security_group.eks_node_group will be created
+ resource "aws_security_group" "eks_node_group" {
      + arn                    = (known after apply)
      + description            = "Security group for node group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "eks-eksdapne2-lvvd-ng"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "ap-northeast-2"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                                 = "eks-eksdapne2-lvvd-ng"
          + "account"                              = "id"
          + "aws_region"                           = "ap-northeast-2"
          + "kubernetes.io/cluster/eksdapne2-lvvd" = "owned"
          + "product"                              = "eks"
          + "shard_id"                             = "eksdapne2"
        }
      + tags_all               = {
          + "Name"                                 = "eks-eksdapne2-lvvd-ng"
          + "account"                              = "id"
          + "aws_region"                           = "ap-northeast-2"
          + "kubernetes.io/cluster/eksdapne2-lvvd" = "owned"
          + "product"                              = "eks"
          + "shard_id"                             = "eksdapne2"
        }
      + vpc_id                 = "vpc-02c04a80aa4e3c6e9"
    }

  # module.eks.aws_sqs_queue.aws_node_termination_handler_queue will be created
+ resource "aws_sqs_queue" "aws_node_termination_handler_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = 0
      + max_message_size                  = 262144
      + message_retention_seconds         = 43200
      + name                              = "eksdapne2-lvvd-aws-node-termination-handler-queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + region                            = "ap-northeast-2"
      + sqs_managed_sse_enabled           = true
      + tags                              = {
          + "Name"       = "eksdapne2-lvvd-aws-node-termination-handler-queue"
          + "account"    = "id"
          + "aws_region" = "ap-northeast-2"
          + "product"    = "eks"
          + "shard_id"   = "eksdapne2"
        }
      + tags_all                          = {
          + "Name"       = "eksdapne2-lvvd-aws-node-termination-handler-queue"
          + "account"    = "id"
          + "aws_region" = "ap-northeast-2"
          + "product"    = "eks"
          + "shard_id"   = "eksdapne2"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.eks.aws_sqs_queue_policy.aws_node_termination_handler_queue will be created
+ resource "aws_sqs_queue_policy" "aws_node_termination_handler_queue" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
      + region    = "ap-northeast-2"
    }

Plan: 56 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ aws_iam_openid_connect_provider_arn       = (known after apply)
+ aws_iam_openid_connect_provider_url       = (known after apply)
+ aws_security_group_eks_cluster_default_id = (known after apply)
+ aws_security_group_eks_cluster_id         = (known after apply)
+ aws_security_group_eks_node_group_id      = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p eks/eksd_apnortheast2/eksdapne2-lvvd`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.overtake.live/lock?id=alpha3002025%252Feks-tf-provisioning%252Fterraform%252Feks%252Feksd_apnortheast2%252Feksdapne2-lvvd%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p eks/eksd_apnortheast2/eksdapne2-lvvd`
</details>
Plan: 56 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
